
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.neworking.module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "ap-southeast-1"
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-default"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-default"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.neworking.module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "ap-southeast-1"
      + route                  = (known after apply)
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-default"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-default"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.neworking.module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "ap-southeast-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-default"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-default"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.neworking.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "ap-southeast-1"
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-ap-southeast-1b"
          + "Terraform"   = "true"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-ap-southeast-1b"
          + "Terraform"   = "true"
        }
    }

  # module.neworking.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "ap-southeast-1"
      + tags     = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc"
          + "Terraform"   = "true"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc"
          + "Terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.neworking.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "ap-southeast-1"
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-ap-southeast-1b"
          + "Terraform"   = "true"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-ap-southeast-1b"
          + "Terraform"   = "true"
        }
    }

  # module.neworking.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "ap-southeast-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.neworking.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "ap-southeast-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.neworking.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "ap-southeast-1"
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-private"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-private"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.neworking.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "ap-southeast-1"
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-public"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-public"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.neworking.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "ap-southeast-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.neworking.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "ap-southeast-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.neworking.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "ap-southeast-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.neworking.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "ap-southeast-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.neworking.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-southeast-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-private-ap-southeast-1b"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-private-ap-southeast-1b"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.neworking.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-southeast-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-private-ap-southeast-1a"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-private-ap-southeast-1a"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.neworking.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-southeast-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-public-ap-southeast-1b"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-public-ap-southeast-1b"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.neworking.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-southeast-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-public-ap-southeast-1a"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc-public-ap-southeast-1a"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.neworking.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "ap-southeast-1"
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "dev-core-banking-vpc"
          + "Terraform"   = "true"
        }
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + networking = {
      + networking = {
          + azs                                         = [
              + "ap-southeast-1b",
              + "ap-southeast-1a",
            ]
          + cgw_arns                                    = []
          + cgw_ids                                     = []
          + database_internet_gateway_route_id          = null
          + database_ipv6_egress_route_id               = null
          + database_nat_gateway_route_ids              = []
          + database_network_acl_arn                    = null
          + database_network_acl_id                     = null
          + database_route_table_association_ids        = []
          + database_route_table_ids                    = [
              + (known after apply),
            ]
          + database_subnet_arns                        = []
          + database_subnet_group                       = null
          + database_subnet_group_name                  = null
          + database_subnet_objects                     = []
          + database_subnets                            = []
          + database_subnets_cidr_blocks                = []
          + database_subnets_ipv6_cidr_blocks           = []
          + default_network_acl_id                      = (known after apply)
          + default_route_table_id                      = (known after apply)
          + default_security_group_id                   = (known after apply)
          + default_vpc_arn                             = null
          + default_vpc_cidr_block                      = null
          + default_vpc_default_network_acl_id          = null
          + default_vpc_default_route_table_id          = null
          + default_vpc_default_security_group_id       = null
          + default_vpc_enable_dns_hostnames            = null
          + default_vpc_enable_dns_support              = null
          + default_vpc_id                              = null
          + default_vpc_instance_tenancy                = null
          + default_vpc_main_route_table_id             = null
          + dhcp_options_id                             = null
          + egress_only_internet_gateway_id             = null
          + elasticache_network_acl_arn                 = null
          + elasticache_network_acl_id                  = null
          + elasticache_route_table_association_ids     = []
          + elasticache_route_table_ids                 = (known after apply)
          + elasticache_subnet_arns                     = []
          + elasticache_subnet_group                    = null
          + elasticache_subnet_group_name               = null
          + elasticache_subnet_objects                  = []
          + elasticache_subnets                         = []
          + elasticache_subnets_cidr_blocks             = []
          + elasticache_subnets_ipv6_cidr_blocks        = []
          + igw_arn                                     = (known after apply)
          + igw_id                                      = (known after apply)
          + intra_network_acl_arn                       = null
          + intra_network_acl_id                        = null
          + intra_route_table_association_ids           = []
          + intra_route_table_ids                       = []
          + intra_subnet_arns                           = []
          + intra_subnet_objects                        = []
          + intra_subnets                               = []
          + intra_subnets_cidr_blocks                   = []
          + intra_subnets_ipv6_cidr_blocks              = []
          + name                                        = "dev-core-banking-vpc"
          + nat_ids                                     = [
              + (known after apply),
            ]
          + nat_public_ips                              = [
              + (known after apply),
            ]
          + natgw_ids                                   = [
              + (known after apply),
            ]
          + natgw_interface_ids                         = [
              + (known after apply),
            ]
          + outpost_network_acl_arn                     = null
          + outpost_network_acl_id                      = null
          + outpost_subnet_arns                         = []
          + outpost_subnet_objects                      = []
          + outpost_subnets                             = []
          + outpost_subnets_cidr_blocks                 = []
          + outpost_subnets_ipv6_cidr_blocks            = []
          + private_ipv6_egress_route_ids               = []
          + private_nat_gateway_route_ids               = [
              + (known after apply),
            ]
          + private_network_acl_arn                     = null
          + private_network_acl_id                      = null
          + private_route_table_association_ids         = [
              + (known after apply),
              + (known after apply),
            ]
          + private_route_table_ids                     = [
              + (known after apply),
            ]
          + private_subnet_arns                         = [
              + (known after apply),
              + (known after apply),
            ]
          + private_subnet_objects                      = [
              + {
                  + arn                                            = (known after apply)
                  + assign_ipv6_address_on_creation                = false
                  + availability_zone                              = "ap-southeast-1b"
                  + availability_zone_id                           = (known after apply)
                  + cidr_block                                     = "10.0.1.0/24"
                  + customer_owned_ipv4_pool                       = null
                  + enable_dns64                                   = false
                  + enable_lni_at_device_index                     = null
                  + enable_resource_name_dns_a_record_on_launch    = false
                  + enable_resource_name_dns_aaaa_record_on_launch = false
                  + id                                             = (known after apply)
                  + ipv6_cidr_block                                = null
                  + ipv6_cidr_block_association_id                 = (known after apply)
                  + ipv6_native                                    = false
                  + map_customer_owned_ip_on_launch                = null
                  + map_public_ip_on_launch                        = false
                  + outpost_arn                                    = null
                  + owner_id                                       = (known after apply)
                  + private_dns_hostname_type_on_launch            = (known after apply)
                  + region                                         = "ap-southeast-1"
                  + tags                                           = {
                      + Environment = "dev"
                      + Name        = "dev-core-banking-vpc-private-ap-southeast-1b"
                      + Terraform   = "true"
                    }
                  + tags_all                                       = {
                      + Environment = "dev"
                      + Name        = "dev-core-banking-vpc-private-ap-southeast-1b"
                      + Terraform   = "true"
                    }
                  + timeouts                                       = null
                  + vpc_id                                         = (known after apply)
                },
              + {
                  + arn                                            = (known after apply)
                  + assign_ipv6_address_on_creation                = false
                  + availability_zone                              = "ap-southeast-1a"
                  + availability_zone_id                           = (known after apply)
                  + cidr_block                                     = "10.0.2.0/24"
                  + customer_owned_ipv4_pool                       = null
                  + enable_dns64                                   = false
                  + enable_lni_at_device_index                     = null
                  + enable_resource_name_dns_a_record_on_launch    = false
                  + enable_resource_name_dns_aaaa_record_on_launch = false
                  + id                                             = (known after apply)
                  + ipv6_cidr_block                                = null
                  + ipv6_cidr_block_association_id                 = (known after apply)
                  + ipv6_native                                    = false
                  + map_customer_owned_ip_on_launch                = null
                  + map_public_ip_on_launch                        = false
                  + outpost_arn                                    = null
                  + owner_id                                       = (known after apply)
                  + private_dns_hostname_type_on_launch            = (known after apply)
                  + region                                         = "ap-southeast-1"
                  + tags                                           = {
                      + Environment = "dev"
                      + Name        = "dev-core-banking-vpc-private-ap-southeast-1a"
                      + Terraform   = "true"
                    }
                  + tags_all                                       = {
                      + Environment = "dev"
                      + Name        = "dev-core-banking-vpc-private-ap-southeast-1a"
                      + Terraform   = "true"
                    }
                  + timeouts                                       = null
                  + vpc_id                                         = (known after apply)
                },
            ]
          + private_subnets                             = [
              + (known after apply),
              + (known after apply),
            ]
          + private_subnets_cidr_blocks                 = [
              + "10.0.1.0/24",
              + "10.0.2.0/24",
            ]
          + private_subnets_ipv6_cidr_blocks            = []
          + public_internet_gateway_ipv6_route_id       = null
          + public_internet_gateway_route_id            = (known after apply)
          + public_network_acl_arn                      = null
          + public_network_acl_id                       = null
          + public_route_table_association_ids          = [
              + (known after apply),
              + (known after apply),
            ]
          + public_route_table_ids                      = [
              + (known after apply),
            ]
          + public_subnet_arns                          = [
              + (known after apply),
              + (known after apply),
            ]
          + public_subnet_objects                       = [
              + {
                  + arn                                            = (known after apply)
                  + assign_ipv6_address_on_creation                = false
                  + availability_zone                              = "ap-southeast-1b"
                  + availability_zone_id                           = (known after apply)
                  + cidr_block                                     = "10.0.101.0/24"
                  + customer_owned_ipv4_pool                       = null
                  + enable_dns64                                   = false
                  + enable_lni_at_device_index                     = null
                  + enable_resource_name_dns_a_record_on_launch    = false
                  + enable_resource_name_dns_aaaa_record_on_launch = false
                  + id                                             = (known after apply)
                  + ipv6_cidr_block                                = null
                  + ipv6_cidr_block_association_id                 = (known after apply)
                  + ipv6_native                                    = false
                  + map_customer_owned_ip_on_launch                = null
                  + map_public_ip_on_launch                        = false
                  + outpost_arn                                    = null
                  + owner_id                                       = (known after apply)
                  + private_dns_hostname_type_on_launch            = (known after apply)
                  + region                                         = "ap-southeast-1"
                  + tags                                           = {
                      + Environment = "dev"
                      + Name        = "dev-core-banking-vpc-public-ap-southeast-1b"
                      + Terraform   = "true"
                    }
                  + tags_all                                       = {
                      + Environment = "dev"
                      + Name        = "dev-core-banking-vpc-public-ap-southeast-1b"
                      + Terraform   = "true"
                    }
                  + timeouts                                       = null
                  + vpc_id                                         = (known after apply)
                },
              + {
                  + arn                                            = (known after apply)
                  + assign_ipv6_address_on_creation                = false
                  + availability_zone                              = "ap-southeast-1a"
                  + availability_zone_id                           = (known after apply)
                  + cidr_block                                     = "10.0.102.0/24"
                  + customer_owned_ipv4_pool                       = null
                  + enable_dns64                                   = false
                  + enable_lni_at_device_index                     = null
                  + enable_resource_name_dns_a_record_on_launch    = false
                  + enable_resource_name_dns_aaaa_record_on_launch = false
                  + id                                             = (known after apply)
                  + ipv6_cidr_block                                = null
                  + ipv6_cidr_block_association_id                 = (known after apply)
                  + ipv6_native                                    = false
                  + map_customer_owned_ip_on_launch                = null
                  + map_public_ip_on_launch                        = false
                  + outpost_arn                                    = null
                  + owner_id                                       = (known after apply)
                  + private_dns_hostname_type_on_launch            = (known after apply)
                  + region                                         = "ap-southeast-1"
                  + tags                                           = {
                      + Environment = "dev"
                      + Name        = "dev-core-banking-vpc-public-ap-southeast-1a"
                      + Terraform   = "true"
                    }
                  + tags_all                                       = {
                      + Environment = "dev"
                      + Name        = "dev-core-banking-vpc-public-ap-southeast-1a"
                      + Terraform   = "true"
                    }
                  + timeouts                                       = null
                  + vpc_id                                         = (known after apply)
                },
            ]
          + public_subnets                              = [
              + (known after apply),
              + (known after apply),
            ]
          + public_subnets_cidr_blocks                  = [
              + "10.0.101.0/24",
              + "10.0.102.0/24",
            ]
          + public_subnets_ipv6_cidr_blocks             = []
          + redshift_network_acl_arn                    = null
          + redshift_network_acl_id                     = null
          + redshift_public_route_table_association_ids = []
          + redshift_route_table_association_ids        = []
          + redshift_route_table_ids                    = [
              + (known after apply),
            ]
          + redshift_subnet_arns                        = []
          + redshift_subnet_group                       = null
          + redshift_subnet_objects                     = []
          + redshift_subnets                            = []
          + redshift_subnets_cidr_blocks                = []
          + redshift_subnets_ipv6_cidr_blocks           = []
          + this_customer_gateway                       = {}
          + vgw_arn                                     = null
          + vgw_id                                      = null
          + vpc_arn                                     = (known after apply)
          + vpc_block_public_access_exclusions          = {}
          + vpc_cidr_block                              = "10.0.0.0/16"
          + vpc_enable_dns_hostnames                    = true
          + vpc_enable_dns_support                      = true
          + vpc_flow_log_cloudwatch_iam_role_arn        = ""
          + vpc_flow_log_deliver_cross_account_role     = null
          + vpc_flow_log_destination_arn                = ""
          + vpc_flow_log_destination_type               = "cloud-watch-logs"
          + vpc_flow_log_id                             = null
          + vpc_id                                      = (known after apply)
          + vpc_instance_tenancy                        = "default"
          + vpc_ipv6_association_id                     = (known after apply)
          + vpc_ipv6_cidr_block                         = (known after apply)
          + vpc_main_route_table_id                     = (known after apply)
          + vpc_owner_id                                = (known after apply)
          + vpc_secondary_cidr_blocks                   = []
        }
    }

<!-- Sticky Pull Request Comment -->